{"class_name": "Model", "keras_version": "1.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 100, 1000], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 6, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 8, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 6}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "maxpooling2d_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 6, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 16, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 6}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "maxpooling2d_8"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "name": "flatten_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_4", 0, 0]]], "name": "dense_9"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["dense_9", 0, 0]]], "name": "dense_10"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "model_4"}}