{"loss": "mse", "optimizer": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Nadam", "epsilon": 1e-08, "lr": 0.0020000000949949026, "schedule_decay": 0.004}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 16, "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dtype": "float32", "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "linear", "batch_input_shape": [null, 15]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "WeightRegularizer", "l1": 9.999999747378752e-05}, "activation": "linear", "output_dim": 8}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "WeightRegularizer", "l1": 9.999999747378752e-05}, "activation": "linear", "output_dim": 4}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}], "sample_weight_mode": null}